Revit 2027 API
BuiltInFailures.KeyBasedTreeEntryFailures Class
 Failures about KeyBasedTreeEntry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class KeyBasedTreeEntryFailures
Public NotInheritable Class KeyBasedTreeEntryFailures
public ref class KeyBasedTreeEntryFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type KeyBasedTreeEntryFailures = class end
The BuiltInFailures.KeyBasedTreeEntryFailures type exposes the following members.
Properties
Name | Description
BadClassificationLevel |  Level [Level] of Classification [Code] is not an integer from 1 to 5.
CircularParentage |  A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]'
DuplicateEntry |  Duplicate code '[Code]', description: '[Description]'
MissingParent |  No parent [EntryType] '[Code]' for '[Code]'
Top
See Also
Reference
Autodesk.Revit.DB Namespace